<?php

return [
    'users_list' => [
        'display_name' => 'Список пользователей',
        'description' => 'Позволяет просматривать список пользователей.',
    ],
    'users_show' => [
        'display_name' => 'Просмотр деталей пользователя',
        'description' => 'Позволяет просматривать детали конкретного пользователя.',
    ],
    'users_create' => [
        'display_name' => 'Создать пользователей',
        'description' => 'Позволяет создавать новых пользователей.',
    ],
    'users_edit_own' => [
        'display_name' => 'Редактировать свой профиль',
        'description' => 'Позволяет редактировать только профиль авторизованного пользователя.',
    ],
    'users_edit_all' => [
        'display_name' => 'Редактировать всех пользователей',
        'description' => 'Позволяет редактировать любого пользователя в системе.',
    ],
    'users_delete' => [
        'display_name' => 'Удалить пользователей',
        'description' => 'Позволяет удалять пользователей.',
    ],
    'users_change_password' => [
        'display_name' => 'Сменить пароль пользователя',
        'description' => 'Позволяет изменить пароль пользователя.',
    ],
    'users_update_password' => [
        'display_name' => 'Обновить пароль пользователя',
        'description' => 'Позволяет обновить пароль пользователя.',
    ],
    'roles_list' => [
        'display_name' => 'Список ролей',
        'description' => 'Позволяет просматривать список ролей.',
    ],
    'roles_create' => [
        'display_name' => 'Создать роли',
        'description' => 'Позволяет создавать новые роли с разрешениями.',
    ],
    'roles_edit' => [
        'display_name' => 'Редактировать роли',
        'description' => 'Позволяет редактировать разрешения ролей.',
    ],
    'roles_destroy' => [
        'display_name' => 'Удалить роли',
        'description' => 'Позволяет удалять роли.',
    ],
    'audit_list' => [
        'display_name' => 'Список аудитов',
        'description' => 'Позволяет просматривать список аудитов.',
    ],
    'config_list' => [
        'display_name' => 'Список конфигураций',
        'description' => 'Позволяет просматривать список конфигураций.',
    ],
];
