<?php

return array (
  'title' => 'Редактировать конфигурацию',
  'breadcrumb' => 'Управление',
  'text_settings' => 'Настройки текста',
  'image_settings' => 'Настройки изображения',
  'save_changes' => 'Сохранить изменения',
  'success' => 'Успех!',
  'error' => 'Ошибка!',
  'success_message' => 'Изменения были сохранены правильно.',
  'error_message' => 'При сохранении изменений была проблема.',
  'accept' => 'Принимать',
  'update_success' => 'Обновленная конфигурация успешно.',
  'app_name' => 'Имя приложения',
  'favicon' => 'Фавикон',
  'logo_rectangular' => 'Прямоугольный логотип',
  'logo_square' => 'Квадратный логотип',
  'validation_app_name' => 'Имя приложения не может превышать 255 символов.',
  'validation_image' => 'Файл должен быть изображением и не должен превышать 2 МБ.',
);
